use danji;

INSERT INTO available_merchant
VALUES
    (UUID_TO_BIN(UUID()),'아이즈광고기획', '부산광역시 사상구 사상로 467(모라동)', 0.0, 0.0, '기타', UUID_TO_BIN('11111111-1111-1111-1111-111111111111'), NOW(), NOW()),
    (UUID_TO_BIN(UUID()),'피자나라치킨공주', '부산광역시 사상구 사상로 468-11층 (모라동)', 0.0, 0.0, '음식점', UUID_TO_BIN('11111111-1111-1111-1111-111111111111'), NOW(), NOW()),
    (UUID_TO_BIN(UUID()),'어가스시', '부산광역시 사상구 사상로 468-1어가스시 (모라동)', 0.0, 0.0, '기타', UUID_TO_BIN('11111111-1111-1111-1111-111111111111'), NOW(), NOW()),
    (UUID_TO_BIN(UUID()),'멀티25시슈퍼', '부산광역시 사상구 사상로 46924시마트 1층 (모라동)', 0.0, 0.0, '슈퍼/마트', UUID_TO_BIN('11111111-1111-1111-1111-111111111111'), NOW(), NOW()),
    (UUID_TO_BIN(UUID()),'꼬꼬치킨', '부산광역시 사상구 사상로 471-1(모라동)', 0.0, 0.0, '음식점', UUID_TO_BIN('11111111-1111-1111-1111-111111111111'), NOW(), NOW()),
    (UUID_TO_BIN(UUID()),'이루다식당', '부산광역시 사상구 사상로 471-1(모라동)', 0.0, 0.0, '기타', UUID_TO_BIN('11111111-1111-1111-1111-111111111111'), NOW(), NOW()),
    (UUID_TO_BIN(UUID()),'남도푸드', '부산광역시 사상구 사상로 471-1(모라동)', 0.0, 0.0, '음식점', UUID_TO_BIN('11111111-1111-1111-1111-111111111111'), NOW(), NOW()),
    (UUID_TO_BIN(UUID()),'빌존아지트', '부산광역시 사상구 사상로 471-13층 (모라동, 캐롱샷)', 0.0, 0.0, '기타', UUID_TO_BIN('11111111-1111-1111-1111-111111111111'), NOW(), NOW()),
    (UUID_TO_BIN(UUID()),'동백베이커리', '부산광역시 사상구 사상로 475-141층 (모라동)', 0.0, 0.0, '카페/베이커리', UUID_TO_BIN('11111111-1111-1111-1111-111111111111'), NOW(), NOW()),
    (UUID_TO_BIN(UUID()),'동백커피', '부산광역시 사상구 사상로 475-142층 (모라동)', 0.0, 0.0, '음식점', UUID_TO_BIN('11111111-1111-1111-1111-111111111111'), NOW(), NOW());

SELECT BIN_TO_UUID(local_currency_id) FROM local_currency;
